{
    "aboutMe": {
        "bio": {
            "title": "About Me",
            "content":
                "<p>I have a decade of experience in the industry behind me and I&apos;m well-versed in a variety of disciplines, but I&apos;m continuously striving to develop my skills and push my boundaries as much as possible.</p><p>I&apos;m passionate about exploring new tools to give me the best outcomes and how to express myself in a creative work environment. I&apos;m a strong believer in the power of collaboration and I&apos;m always seeking an environment that encourages open dialogue and creative problem solving. I&apos;m always eager to work with a variety of people to develop ideas and bring them to life.</p><p>In my spare time I like to get out in nature, and over the past few years have become a bit of a fungi fanatic.</p>"
        },
        "socialMedia": [
            {
                "platform": "Facebook",
                "url": "#",
                "fontawesomeIcon": "faFacebookF"
            },
            {
                "platform": "Instagram",
                "url": "#",
                "fontawesomeIcon": "faInstagram"
            },
            {
                "platform": "Dribbble",
                "url": "#",
                "fontawesomeIcon": "faDribbble"
            }
        ],
        "design": [
            {
                "title": "Software",
                "list": ["Adobe Illustrator", "Adobe Photoshop", "Figma"]
            },
            {
                "title": "Competencies",
                "list": ["Branding", "Wireframing", "UI Design", "Web Design", "Graphics"]
            }
        ],
        "developer": [
            {
                "title": "code Editor",
                "list": ["VS Code", " Adobe Dreamweaver"]
            },
            {
                "title": "Code",
                "list": ["HTML5", "CSS3", "JavaScript", "SVG"]
            },
            {
                "title": "Libraries",
                "list": ["React Js", "Framer Motion", "GSAP", "Chakra UI"]
            },
            { "title": "Styling", "list": ["CSS Modules", "Styled-components"] },
            { "title": "Frameworks", "list": ["Next Js", "Gatsby Js"] },
            { "title": "VC", "list": ["GitHub"] }
        ]
    },
    "projects": [
        {
            "id": 1,
            "projectTitle": "Graft Haus",
            "link": "https://www.grafthaus.co.uk",
            "testimonial": "We took on Aaron to revamp our gym website which was approaching 3 years old, and needed a complete refresh having originally being built by us. After giving a single page brief, we awaited initial design options, and when they came in, immediately knew we had made the right choice in off loading the project to a professional. We knew we could trust his artistic direction completely, and after we had confirmed our more detailed requirements, we had very little critical input left to do. Aaron hit all the milestones on time, with fabulous attention to detail, and the whole process was a pleasure. We love our new site, it delivers our brand identity effortlessly, and is snappy and responsive across all platforms.",
            "testimonialAuthor": "Tony",
            "services": ["wireframing", "Web design", "Web development", "WordPress CMS"],
            "tech": ["PHP", "Advanced Custom Fields"],
            "color": "#111111",
            "background": "#FFFFFF",
            "details": [
                {
                    "id": 1,
                    "component": "text",
                    "title": "Graft Haus",
                    "content":"<p>Graft Haus gym in Leeds needed a more bespoke website solution after their pre-bought theme became too limiting for the design styles they were going for. I created a new Wordpress theme from scratch, utilising my favourite plugin Advanced Custom Fields, which would give the client more control over adding content without the need for understanding design principles through the wysiwyg editor. The new site, which was designed and built in 2020 is fully responsive and sits neatly within the Graft Haus brand.</p><p>This was one of the last SSR websites that I built before looking more seriously into JavaScript and React. Although the client is currently very pleased with the website, I&apos;m hoping to get the opportunity to rebuild the frontend with Next JS and use WordPress as a headless CMS in the future to improve performance and security.</p>",
                    "logo": "portfolio/grafthaus/logo.svg"
                },
                {
                    "id": 2,
                    "component": "imageMobile",
                    "imageUrls":["portfolio/grafthaus/home.webp", "portfolio/grafthaus/grafthausnav_optimised.mp4", "portfolio/grafthaus/membership.webp"]
                },
                {
                    "id": 3,
                    "component": "imageDesktop",
                    "imageUrl":"portfolio/grafthaus/membership.webp"
                }
               
            ]
        },
        {
            "id": 2,
            "projectTitle": "Vitfor",
            "link": "https://www.vitfor.com",
            "testimonial": "Aaron is pretty good",
            "testimonialAuthor": "Tamsin",
            "services": [
                "Brand modernisation",
                "wireframing",
                "App UI Design",
                "Web design"
            ],
            "tech": ["Next Js", "Chakra UI", "TypeScript", "Framer Motion"],
            "color": "#111111",
            "background": "#f8c110",
            "details": [
                {
                    "id": 1,
                    "component": "text",
                    "title": "Vitfor",
                    "content":"<p>Vitfor were in the process of planning a complete redesign and rebuild of their web app and site in the latest web technologies when they brought me on board to assist with the design aspect of the project. Throughout the initial stages I collaborated with other members of the team and reviewed market research to help me produce user flow sheets, wireframes and design sprints. Mapping every aspect of the design ready for handover to the dev team taught me a great deal about the value of exhaustive planning before executing a project of this scale.</p><p>Overall I modernised the Vitfor logo, established a new colour scheme, designed the UI for the web app, then designed and built the point-of-sale website using the same tech stack as the web app so that everything sat nicely within the project ecosystem. This was my first major leap from Gatsby JS to Next JS and also a first for me working with TypeScript, Chakra UI and Styled-components. One library I did bring to the table was Framer Motion, which I used to implement page transitions as well as scroll-based and SVG animations for a more fluid UX.</p><p>This was my first time working on such an extensive project and collaborating with a team as a freelancer, meaning this has easily become one of the most fulfilling projects I&apos;ve ever worked on. I look forward to lending my hand with further development on this project in the future.</p>",
                    "logo": "portfolio/vitfor/logo.svg"
                },
                {
                    "id": 2,
                    "component": "imageMobile",
                    "imageUrls":["vercel.svg", "next.svg"]
                    
                }
            ]
        },
        {
            "id": 3,
            "projectTitle": "Wayne Anthony",
            "link": "https://www.wayneanthonys.co.uk",
            "testimonial": "Yeah ZEN MATE",
            "testimonialAuthor": "Wayne",
            "services": ["Web design", "Web development", "WordPress CMS"],
            "tech": [
                "Gatsby Js",
                "SnipCart Js",
                "Framer Motion",
                "Advanced Custom Fields"
            ],
            "color": "#0c0c0b",
            "background": "#ff6a66",
            
            "details": [
                {
                    "id": 1,
                    "component": "text",
                    "title": "Wayne Anthony&apos;s Barbershop",
                    "content":"<p>Wayne Anthony is a entrepreneur and close friend of mine who I&apos;ve worked with on a few occasions in the past on small web projects. Wayne likes cheap and cheerful but I always try to go above and beyond for him as I love his passion for ideas and his aesthetic. I generally use these little projects as opportunities to grow my tech stack or experiment with my own ideas; generally Wayne is all for it, so long as I don&apos;t break the bank!</p><p>Wayne&apos;s barbershop website had been live almost as long as I&apos;d been working in the creative industry; that should give you an idea of just how old his website was. The website was just another heavily bloated, off-the-shelf theme with lighthouse scores that made my eyes water. I had some discussion with Wayne about my ideas before making a start. The website was designed and signed off within a week and I got to work building the website in Gatsby JS and hooking up his WordPress as a headless CMS. The result is a website with a premium feel that performs well and even has shopping cart functionality (SnipCart JS). Not bad for a £1200 budget.</p>",
                    "logo": "portfolio/wayneanthony/logo.svg"
                },
                {
                    "id": 2,
                    "component": "imageMobile",
                    "imageUrls":["vercel.svg", "next.svg"]
                }
            ]
        }
    ]
}